
#include <string>

namespace alarm_define {
	struct alarm_info {
		int alarm_id;
		std::string alarm_name;
		int alarm_lever;
		int alarm_input_fps;
	};

	std::vector<alarm_info> alarm_map({ {1, "液压站介质泄漏异常", 3, 2},
										{2, "水池液位溢出异常", 3, 2},
										{3, "风机站电机异常", 3, 0},
										{4, "轧区轧机电机异常", 3, 0},
										{5, "液压站电机异常", 3, 0},
										{6, "轧区堆钢异常", 1, 0},
										{7, "轧区飞剪异常", 2, 0},
										{8, "旋转盘旋转异常", 3, 15},
										{9, "直送追钢报警", 2, 15},
										{10, "提升机链条异常", 1, 15},
										{11, "上料台架双钢异常", 2, 15},
										{12, "上料台架弯钢异常", 2, 15},
										{13, "加热炉装钢异常", 1, 15},
										{14, "加热炉出钢异常", 1, 15},
										{15, "炉底水池溢出异常", 3, 15},
										{16, "汽包液位异常", 1, 15},
										{17, "轧机入口咬钢异常", 1, 15},
										{18, "轧机堆钢异常", 1, 15},
										{19, "冷床切分异常", 2, 15},
										{20, "冷床冲顶异常", 1, 15},
										{21, "冷床出口乱钢异常", 2, 15} });

}